docker.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>docker</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="orgf852894">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org24982aa" class="outline-2">
<h2 id="org24982aa">docker</h2>
<div class="outline-text-2" id="text-org24982aa">
</div>
<div id="outline-container-org7fab516" class="outline-3">
<h3 id="org7fab516">dockerfile of multi image builder</h3>
<div class="outline-text-3" id="text-org7fab516">
<div class="org-src-container">
<pre class="src src-dockerfile" id="org53ebb9b">FROM clojure as builder
RUN mkdir -p /usr/src/app
WORKDIR /usr/src/app
COPY project.clj /usr/src/app/
RUN lein deps
COPY src /usr/src/app/src
RUN mv "$(lein uberjar | sed -n 's/^Created \(.*standalone\.jar\)/\1/p')" app-standalone.jar

FROM jam/graal as native
WORKDIR /tmp
COPY --from=builder /usr/src/app/app-standalone.jar ./
# graal reflection json config for snakeyaml.
COPY graal.json .
RUN graalvm-ce-${GRAALVM_V}/bin/native-image \
  --no-server \
  --static \
  -H:ReflectionConfigurationFiles=/tmp/graal.json \
#  -H:+ReportUnsupportedElementsAtRuntime \
  -jar /tmp/app-standalone.jar

FROM scratch
COPY --from=native /tmp/app-standalone .
ENTRYPOINT ["/app-standalone"]
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
